Repository: youssefssef/TeleMedcine
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Log In
ar: تسجيل دخول
fr: Connexion

# signInToYourAccount
source: sign in to your account to proceed
ar: قم بتسجيل الدخول إلى حسابك للمتابعة
fr: connectez-vous à votre compte pour continuer

source: Entre your email...
ar: ...أدخل بريدك الإلكتروني
fr: Entrez votre email...

source: Entre your password...
ar: أدخل كلمة المرور الخاصة بك
fr: Entrez votre mot de passe...

source: Sign in
ar: تسجيل
fr: S'identifier

source: you do not have account
ar: ليس لديك حساب
fr: vous n'avez pas de compte

source: Create
ar: الإنشاء
fr: Créer

source: Sign Up
ar: اشتراك
fr: S'inscrire

source: Create your account to proceed
ar: إنشاء حسابك للمتابعة
fr: Créez votre compte pour continuer

source: Add Profile Picture
ar: أضف صورة الملف الشخصي
fr: Ajouter une photo de profil

source: Entre your name...
ar: أدخل أسمك...
fr: Entrez votre nom...

source: Entre your phone...
ar: أدخل هاتفك ...
fr: Entrez votre téléphone...

source: Entre the same password...
ar: أدخل نفس كلمة المرور ...
fr: Entrez le même mot de passe...

source: Camera
ar: كاميرا الهاتف
fr: Caméra

source: Gallery
ar: صالة عرض
fr: Galerie

source: Welcome
ar: مرحباً
fr: Bienvenu

source: We Almost there...
ar: نحن على وشك الانتهاء ...
fr: Nous y sommes presque...

source: Please choose your gender
ar: الرجاء اختيار جنسك
fr: Veuillez choisir votre sexe

source: Male
ar: ذكر
fr: Homme

source: Female
ar: أنثى
fr: Femme

source: Swap Left
ar: التبديل إلى اليسار
fr: Permuter à gauche

source: Please choose your birth
ar: الرجاء اختيار تاريخ ولادتك
fr: Veuillez choisir votre naissance

source: Please choose your Weight and height
ar: الرجاء اختيار وزنك وطولك
fr: Veuillez choisir votre poids et votre taille

source: Weight
ar: الوزن
fr: Poids

source: Height
ar: الطول
fr: Hauteur

# whatIsYouBloddType
source: What is your blood type?
ar: ما هى فصيلة دمك؟
fr: Quel est votre groupe sanguin?

source: Blood Type
ar: فصيلة الدم
fr: Groupe sanguin

source: Do you smoke?
ar: هل تدخن؟
fr: Fumez-vous?

# ifYouSmokeOccasionnally
source: If you smoke occasionnally, you should go for a 'No' option
ar: 'إذا كنت تدخن من حين لآخر ، يجب أن تختار خيار 'لا''
fr: Si vous fumez occasionnellement, vous devriez opter pour une option 'Non'

source: Yes, I currently smoke
ar: نعم ، أنا أدخن حاليًا
fr: Oui, je fume actuellement

# noButIamAFomerSmoker
source: No, but i am a former smoker
ar: لا ، لكنني مدخن سابق
fr: Non, mais je suis un ancien fumeur

source: No
ar: لا
fr: Non

# howManyYearsSmoking
source: How many yers have you been smoking?
ar: كم سنة دخنت؟
fr: Depuis combien d'années fumez-vous ?

source: Years...
ar: أعوام...
fr: Ans...

# howManyCigarettes
source: How many cigarettes do you smoke per day?
ar: كم سيجارة تدخن في اليوم؟
fr: Combien de cigarettes fumez-vous par jour ?

# ifYouDoNotSmokejustWrite
source: If you do not smoke just write 0
ar: إذا كنت لا تدخن ، فقط اكتب 0
fr: Si vous ne fumez pas, écrivez simplement 0

source: Amounts of cigarettes...
ar: كمية السجائر ...
fr: Quantité de cigarettes...

# applyToYouWorkLife
source: Does any of the following apply to your work life?
ar: هل ينطبق أي مما يلي على حياتك المهنية؟
fr: L'un des éléments suivants s'applique-t-il à votre vie professionnelle ?

# iSpendMoreThan
source: I spend more than 4 hours a day at my desk and/or looking at a computer screen
ar: أقضي أكثر من 4 ساعات يوميًا على مكتبي و / أو أمام شاشة الكمبيوتر
fr: Je passe plus de 4 heures par jour à mon bureau et/ou devant un écran d'ordinateur

# myJobRequired
source: My job required heavy lifting or other types of physical work
ar: وظيفتي تتطلب رفع الأحمال الثقيلة أو أنواع أخرى من العمل البدني
fr: Mon travail nécessitait de soulever des charges lourdes ou d'autres types de travail physique

source: Neither applies
ar: لا ينطبق أي منهما
fr: Ni l'un ni l'autre ne s'applique

# medicaleConditions
source: Do any of the following medicale conditions apply to your immediate relatives(parents, siblings, grandparents)?
ar: هل تنطبق أي من الحالات الطبية التالية على أقاربك المقربين (الوالدين ، الأشقاء ، الأجداد)؟
fr: L'une des conditions médicales suivantes s'applique-t-elle à vos proches parents (parents, frères et sœurs, grands-parents)?

source: Hearth problems
ar: مشاكل قلبية
fr: Problèmes cardiaques

source: Diabetes
ar: السكري
fr: Diabète

source: High blood pressure
ar: ضغط مرتفع
fr: Hypertension artérielle

source: Psychological diffculties
ar: الاضطرابات النفسية
fr: Troubles psychologiques

source: Lung problems
ar: مشاكل الرئة
fr: Problèmes pulmonaires

source: None
ar: لا شْىء
fr: Aucun

source: Save
ar: حفظ
fr: Sauvegarder
